<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Задача" data-toc-modified-id="Задача-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Задача</a></span></li><li><span><a href="#Задача" data-toc-modified-id="Задача-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Задача</a></span></li><li><span><a href="#Задача" data-toc-modified-id="Задача-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Задача</a></span></li><li><span><a href="#Задача" data-toc-modified-id="Задача-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Задача</a></span></li><li><span><a href="#Задача" data-toc-modified-id="Задача-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Задача</a></span></li><li><span><a href="#Задача" data-toc-modified-id="Задача-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Задача</a></span></li><li><span><a href="#Задача" data-toc-modified-id="Задача-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Задача</a></span></li><li><span><a href="#Задача" data-toc-modified-id="Задача-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Задача</a></span></li><li><span><a href="#Задача" data-toc-modified-id="Задача-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>Задача</a></span></li><li><span><a href="#Задача" data-toc-modified-id="Задача-10"><span class="toc-item-num">10&nbsp;&nbsp;</span>Задача</a></span></li><li><span><a href="#Задача" data-toc-modified-id="Задача-11"><span class="toc-item-num">11&nbsp;&nbsp;</span>Задача</a></span></li><li><span><a href="#Задача" data-toc-modified-id="Задача-12"><span class="toc-item-num">12&nbsp;&nbsp;</span>Задача</a></span></li><li><span><a href="#Задача" data-toc-modified-id="Задача-13"><span class="toc-item-num">13&nbsp;&nbsp;</span>Задача</a></span></li><li><span><a href="#Задача" data-toc-modified-id="Задача-14"><span class="toc-item-num">14&nbsp;&nbsp;</span>Задача</a></span></li><li><span><a href="#Задача" data-toc-modified-id="Задача-15"><span class="toc-item-num">15&nbsp;&nbsp;</span>Задача</a></span></li><li><span><a href="#Задача" data-toc-modified-id="Задача-16"><span class="toc-item-num">16&nbsp;&nbsp;</span>Задача</a></span></li><li><span><a href="#Задача" data-toc-modified-id="Задача-17"><span class="toc-item-num">17&nbsp;&nbsp;</span>Задача</a></span></li><li><span><a href="#Задача" data-toc-modified-id="Задача-18"><span class="toc-item-num">18&nbsp;&nbsp;</span>Задача</a></span></li><li><span><a href="#Задача" data-toc-modified-id="Задача-19"><span class="toc-item-num">19&nbsp;&nbsp;</span>Задача</a></span></li><li><span><a href="#Задача" data-toc-modified-id="Задача-20"><span class="toc-item-num">20&nbsp;&nbsp;</span>Задача</a></span></li><li><span><a href="#Задача" data-toc-modified-id="Задача-21"><span class="toc-item-num">21&nbsp;&nbsp;</span>Задача</a></span></li><li><span><a href="#Задача" data-toc-modified-id="Задача-22"><span class="toc-item-num">22&nbsp;&nbsp;</span>Задача</a></span></li><li><span><a href="#Задача" data-toc-modified-id="Задача-23"><span class="toc-item-num">23&nbsp;&nbsp;</span>Задача</a></span></li></ul></div>

# SQL - практика

В самостоятельном проекте нужно проанализировать данные о фондах и инвестициях и написать запросы к базе.

## Задача

Посчитайте, сколько компаний закрылось.

In [ ]:
SELECT COUNT(id)
FROM company
WHERE status = 'closed'

## Задача

Отобразите количество привлечённых средств для новостных компаний США. Используйте данные из таблицы company. Отсортируйте таблицу по убыванию значений в поле funding_total .

In [ ]:
SELECT funding_total
FROM company
WHERE category_code = 'news'
     AND country_code = 'USA'
ORDER BY funding_total DESC

## Задача

Найдите общую сумму сделок по покупке одних компаний другими в долларах. Отберите сделки, которые осуществлялись только за наличные с 2011 по 2013 год включительно.

In [ ]:
SELECT SUM(price_amount)
FROM acquisition
WHERE term_code = 'cash'
    AND EXTRACT(YEAR FROM acquired_at) BETWEEN '2011' AND '2013'

## Задача

Отобразите имя, фамилию и названия аккаунтов людей в твиттере, у которых названия аккаунтов начинаются на 'Silver'.

In [ ]:
SELECT first_name,
       last_name,
       twitter_username
FROM people
WHERE twitter_username LIKE 'Silver%'

## Задача

Выведите на экран всю информацию о людях, у которых названия аккаунтов в твиттере содержат подстроку 'money', а фамилия начинается на 'K'.

In [ ]:
SELECT *
FROM people
WHERE twitter_username LIKE '%money%'
    AND last_name LIKE 'K%'

## Задача

Для каждой страны отобразите общую сумму привлечённых инвестиций, которые получили компании, зарегистрированные в этой стране. Страну, в которой зарегистрирована компания, можно определить по коду страны. Отсортируйте данные по убыванию суммы.

In [ ]:
SELECT country_code,
       SUM(funding_total) fun
FROM company
GROUP BY country_code
ORDER BY fun DESC

## Задача

Составьте таблицу, в которую войдёт дата проведения раунда, а также минимальное и максимальное значения суммы инвестиций, привлечённых в эту дату.
Оставьте в итоговой таблице только те записи, в которых минимальное значение суммы инвестиций не равно нулю и не равно максимальному значению.

In [ ]:
SELECT funded_at,
       MIN(raised_amount) min_amt,
       MAX(raised_amount) max_amt
FROM funding_round
GROUP BY funded_at
HAVING MIN(raised_amount) != 0
    AND MIN(raised_amount) != MAX(raised_amount)

## Задача

Создайте поле с категориями:
- Для фондов, которые инвестируют в 100 и более компаний, назначьте категорию high_activity.
- Для фондов, которые инвестируют в 20 и более компаний до 100, назначьте категорию middle_activity.
- Если количество инвестируемых компаний фонда не достигает 20, назначьте категорию low_activity.
Отобразите все поля таблицы fund и новое поле с категориями.

In [ ]:
SELECT *,
    CASE
    WHEN invested_companies >= 100 THEN 'high_activity'
    WHEN invested_companies < 20 THEN 'low_activity'
    ELSE 'middle_activity'
    END
FROM fund

## Задача

Для каждой из категорий, назначенных в предыдущем задании, посчитайте округлённое до ближайшего целого числа среднее количество инвестиционных раундов, в которых фонд принимал участие. Выведите на экран категории и среднее число инвестиционных раундов. Отсортируйте таблицу по возрастанию среднего.

In [ ]:
SELECT ROUND(AVG(investment_rounds)) avg_rounds,
       CASE
           WHEN invested_companies>=100 THEN 'high_activity'
           WHEN invested_companies>=20 THEN 'middle_activity'
           ELSE 'low_activity'
       END AS activity
FROM fund
GROUP BY activity
ORDER BY avg_rounds

## Задача

Проанализируйте, в каких странах находятся фонды, которые чаще всего инвестируют в стартапы. 

Для каждой страны посчитайте минимальное, максимальное и среднее число компаний, в которые инвестировали фонды этой страны, основанные с 2010 по 2012 год включительно. Исключите страны с фондами, у которых минимальное число компаний, получивших инвестиции, равно нулю. 

Выгрузите десять самых активных стран-инвесторов: отсортируйте таблицу по среднему количеству компаний от большего к меньшему. Затем добавьте сортировку по коду страны в лексикографическом порядке.

In [ ]:
WITH
tab AS (SELECT country_code,
               MIN(invested_companies) min_icom,
               MAX(invested_companies) max_icom,
               AVG(invested_companies) avg_icom
          FROM fund
          WHERE EXTRACT(YEAR FROM founded_at) BETWEEN 2010 AND 2012
          GROUP BY country_code)

SELECT *
FROM tab
WHERE min_icom > 0 
ORDER BY avg_icom DESC, country_code
LIMIT 10

## Задача

Отобразите имя и фамилию всех сотрудников стартапов. Добавьте поле с названием учебного заведения, которое окончил сотрудник, если эта информация известна.

In [ ]:
SELECT p.first_name,
       p.last_name,
       e.instituition
FROM people p
LEFT JOIN education AS e ON p.id = e.person_id

## Задача

Для каждой компании найдите количество учебных заведений, которые окончили её сотрудники. Выведите название компании и число уникальных названий учебных заведений. Составьте топ-5 компаний по количеству университетов.

In [ ]:
WITH
inst AS (SELECT p.company_id company,
                COUNT(DISTINCT(e.instituition)) AS count
         FROM people p
         LEFT JOIN education AS e ON p.id = e.person_id
         WHERE p.company_id IS NOT NULL
         GROUP BY company
         ORDER BY count DESC
         LIMIT 5)
         
SELECT c.name,
       i.count
FROM inst i
LEFT JOIN company AS c ON i.company = c.id

## Задача

Составьте список с уникальными названиями закрытых компаний, для которых первый раунд финансирования оказался последним.

In [ ]:
SELECT DISTINCT(c.name)
FROM funding_round fr
LEFT JOIN company AS c ON fr.company_id = c.id
WHERE fr.is_first_round = 1
       AND fr.is_last_round = 1
       AND status = 'closed'

## Задача

Составьте список уникальных номеров сотрудников, которые работают в компаниях, отобранных в предыдущем задании.

In [ ]:
SELECT id
FROM people
WHERE company_id IN (SELECT DISTINCT(c.id)
                FROM funding_round fr
                LEFT JOIN company AS c ON fr.company_id = c.id
                WHERE fr.is_first_round = 1
                       AND fr.is_last_round = 1
                       AND status = 'closed')

## Задача

Составьте таблицу, куда войдут уникальные пары с номерами сотрудников из предыдущей задачи и учебным заведением, которое окончил сотрудник.

In [ ]:
SELECT DISTINCT(person_id),
       instituition
FROM education
WHERE person_id IN (SELECT id
                    FROM people
                    WHERE company_id IN (SELECT DISTINCT(c.id)
                                         FROM funding_round fr
                                         LEFT JOIN company AS c ON fr.company_id = c.id
                                         WHERE fr.is_first_round = 1
                                                AND fr.is_last_round = 1
                                                AND status = 'closed'))

## Задача

Посчитайте количество учебных заведений для каждого сотрудника из предыдущего задания. При подсчёте учитывайте, что некоторые сотрудники могли окончить одно и то же заведение дважды.

In [ ]:
WITH
p AS (SELECT person_id AS id,
       instituition inst
      FROM education
      WHERE person_id IN (SELECT id
                          FROM people
                          WHERE company_id IN (SELECT DISTINCT(c.id)
                                               FROM funding_round fr
                                               LEFT JOIN company AS c ON fr.company_id = c.id
                                               WHERE fr.is_first_round = 1
                                                      AND fr.is_last_round = 1
                                                      AND status = 'closed')))

SELECT id,
       COUNT(inst)
FROM p
GROUP BY id

## Задача

Дополните предыдущий запрос и выведите среднее число учебных заведений (всех, не только уникальных), которые окончили сотрудники разных компаний. Нужно вывести только одну запись, группировка здесь не понадобится.

In [ ]:
WITH
p AS (SELECT person_id AS id,
       instituition inst
      FROM education
      WHERE person_id IN (SELECT id
                          FROM people
                          WHERE company_id IN (SELECT DISTINCT(c.id)
                                               FROM funding_round fr
                                               LEFT JOIN company AS c ON fr.company_id = c.id
                                               WHERE fr.is_first_round = 1
                                                      AND fr.is_last_round = 1
                                                      AND status = 'closed')))

SELECT AVG(co.count_in) 
FROM (SELECT id,
       COUNT(inst) count_in
       FROM p
       GROUP BY id) AS co

## Задача

Напишите похожий запрос: выведите среднее число учебных заведений (всех, не только уникальных), которые окончили сотрудники Facebook*.

*(сервис, запрещённый на территории РФ)

In [ ]:
WITH
p AS (SELECT person_id AS id,
       instituition inst
      FROM education
      WHERE person_id IN (SELECT id
                          FROM people
                          WHERE company_id IN (SELECT id
                                               FROM company
                                               WHERE name = 'Facebook')))

SELECT AVG(co.count_in)
FROM (SELECT id,
       COUNT(inst) count_in
       FROM p
       GROUP BY id) AS co

## Задача

Составьте таблицу из полей:
- name_of_fund — название фонда;
- name_of_company — название компании;
- amount — сумма инвестиций, которую привлекла компания в раунде.
В таблицу войдут данные о компаниях, в истории которых было больше шести важных этапов, а раунды финансирования проходили с 2012 по 2013 год включительно.

In [ ]:
WITH
ra AS (SELECT *
       FROM funding_round
       WHERE EXTRACT(YEAR FROM funded_at) BETWEEN 2012 AND 2013)

SELECT f.name name_of_fund,
       c.name name_of_company,
       ra.raised_amount amount
FROM investment i
LEFT JOIN company AS c ON c.id = i.company_id
LEFT JOIN fund AS f ON i.fund_id = f.id
JOIN ra ON ra.id = i.funding_round_id
WHERE c.milestones > 6

## Задача

Выгрузите таблицу, в которой будут такие поля:
- название компании-покупателя;
- сумма сделки;
- название компании, которую купили;
- сумма инвестиций, вложенных в купленную компанию;
- доля, которая отображает, во сколько раз сумма покупки превысила сумму вложенных в компанию инвестиций, округлённая до ближайшего целого числа.

Не учитывайте те сделки, в которых сумма покупки равна нулю. Если сумма инвестиций в компанию равна нулю, исключите такую компанию из таблицы. 
Отсортируйте таблицу по сумме сделки от большей к меньшей, а затем по названию купленной компании в лексикографическом порядке. Ограничьте таблицу первыми десятью записями.

In [ ]:
WITH
fa AS (SELECT *
       FROM acquisition
       WHERE price_amount > 0),
fc AS (SELECT *
       FROM company
       WHERE funding_total > 0)

SELECT c.name buyer,
       fa.price_amount,
       fc.name,
       fc.funding_total,
       ROUND(fa.price_amount/fc.funding_total)
       
FROM fa
JOIN fc ON fa.acquired_company_id = fc.id
LEFT JOIN company AS c ON fa.acquiring_company_id = c.id
ORDER BY fa.price_amount DESC, fc.name
LIMIT 10

## Задача

Выгрузите таблицу, в которую войдут названия компаний из категории social, получившие финансирование с 2010 по 2013 год включительно. Проверьте, что сумма инвестиций не равна нулю. Выведите также номер месяца, в котором проходил раунд финансирования.

In [ ]:
SELECT  c.name,
        EXTRACT(MONTH FROM fr.funded_at)
FROM company c
LEFT JOIN funding_round AS fr ON c.id = fr.company_id
WHERE c.category_code = 'social'
        AND fr.funded_at BETWEEN '2010-01-01' AND '2013-12-31'
        AND fr.raised_amount != 0

## Задача

Отберите данные по месяцам с 2010 по 2013 год, когда проходили инвестиционные раунды. Сгруппируйте данные по номеру месяца и получите таблицу, в которой будут поля:
- номер месяца, в котором проходили раунды;
- количество уникальных названий фондов из США, которые инвестировали в этом месяце;
- количество компаний, купленных за этот месяц;
- общая сумма сделок по покупкам в этом месяце.

In [ ]:
WITH
uf AS (SELECT EXTRACT(MONTH FROM funded_at) AS month,
              COUNT(DISTINCT(f.name)) fund_count
       FROM funding_round AS fr
       LEFT JOIN investment AS i ON fr.id = i.funding_round_id
       LEFT JOIN fund as f ON i.fund_id = f.id
       WHERE EXTRACT(YEAR FROM funded_at) BETWEEN 2010 AND 2013
              AND f.country_code = 'USA'
       GROUP BY month),
       
ac AS (SELECT EXTRACT(MONTH FROM acquired_at) AS month,
              COUNT(acquired_company_id) comp_count,
              SUM(price_amount) amt
       FROM acquisition
       WHERE EXTRACT(YEAR FROM acquired_at) BETWEEN 2010 AND 2013
       GROUP BY month)
       
SELECT uf.month,
       uf.fund_count,
       ac.comp_count,
       ac.amt
FROM uf
JOIN ac ON uf.month = ac.month

## Задача

Составьте сводную таблицу и выведите среднюю сумму инвестиций для стран, в которых есть стартапы, зарегистрированные в 2011, 2012 и 2013 годах. Данные за каждый год должны быть в отдельном поле. Отсортируйте таблицу по среднему значению инвестиций за 2011 год от большего к меньшему.

In [ ]:
WITH
y11 AS (SELECT country_code,
               AVG(funding_total) avg_fund11
        FROM company
        WHERE EXTRACT(YEAR FROM founded_at) = 2011
        GROUP BY country_code),
        
y12 AS (SELECT country_code,
               AVG(funding_total) avg_fund12
        FROM company
        WHERE EXTRACT(YEAR FROM founded_at) = 2012
        GROUP BY country_code),

y13 AS (SELECT country_code,
               AVG(funding_total) avg_fund13
        FROM company
        WHERE EXTRACT(YEAR FROM founded_at) = 2013
        GROUP BY country_code)
        
SELECT y11.country_code,
       y11.avg_fund11,
       y12.avg_fund12,
       y13.avg_fund13
FROM y11
JOIN y12 ON y11.country_code = y12.country_code
JOIN y13 ON y11.country_code = y13.country_code
ORDER BY y11.avg_fund11 DESC